Tekla Open API Reference for Tekla Structures 2025
PrinterItem.Extension Property
 The printer item's default file extension which is used when printing to a file.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Extension { get; set; }
Public Property Extension As String
	Get
	Set
Property Value
Type: String
See Also
Reference
PrinterItem Class
Tekla.Structures.Catalogs Namespace